# -*- coding: utf-8 -*-
"""合同类型枚举 (ContractTypeEnum)。

对应 contract.type 字段。
"""

CONTRACT_TYPE_ENUM = {
    1: "认购合同",
    2: "设计合同",
    3: "正式套餐合同",
    4: "套餐变更协议",
    5: "解约协议",
    6: "整装首期款合同",
    7: "套餐施工图纸",
    8: "销售合同",
    9: "木作首期款协议",
    10: "其他主材首期款协议",
    11: "设计变更协议",
    12: "授权协议书",
    13: "家电首期款协议",
    14: "家居首期款协议",
    15: "定制首期款协议",
    16: "软装首期款协议",
    17: "门窗首期款协议",
    18: "销售合同（零售）",
    19: "销售变更补充协议",
    20: "资金存管协议",
    21: "门窗暖首期款协议",
    22: "全案合同概要",
    23: "图纸报价",
    24: "其他附件",
    25: "K3 首期款协议",
    26: "K5 首期款协议",
    27: "K7 首期款协议",
    28: "授权委托书",
    29: "补充协议",
    30: "和解协议",
}
